rails/projects/ninety_nine_cats_ii/skeleton/app/controllers/sessions_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = 5  [["session_token", "Z061uG_8H5tczmlQXuM0qA"], ["updated_at", "2016-06-01 21:25:28.013583"]]
---
  def create
    @user = User.find_by_credentials(params[:user][:user_name], params[:user][:password])

    if @user.save